 const s = `1. 你属什么的？不，你属于我的2. 我房租到期了，可以去你心里住嘛？3. 我跟你比一下手呗。（伸出手十指相扣）4. 你喜欢猫还是狗，狗：汪~，猫：喵～5. 请问你女/男朋友吗？没有。好，现在你已经有了*6. 我家的狗好喜欢你啊，可能是随我吧7. “我可以亲你吗”“不可以”“我刚刚说了什么”“我可以亲你吗”“可以”8. 下辈子你住我家隔壁好不好 我两青梅竹马两小无猜9 如果1+2=2+1 那么是否 i love you=you love me10. 遇见你之前我没想过结婚这事，遇见你之后结婚这事我没想过别人11. 我发现有人暗恋你   谁啊？我啊12. 对你这种人，除了恋爱，我没什么和你谈的！13. 你瘦的时候在我心里胖了就在里面卡着出不来了14. 其实见到你第一面我就想认识你了，他们斯文人把这个叫做一见钟情15. 照的这张自拍真丑，还不及你本人十分之一好看16. 你要是丑点，我或许可以带你逛街看电影吃西餐散散步看星星看月亮，从诗词歌赋谈到人生哲学，可你长的那么好看，让我只想和你恋爱。17. 我结婚你一定要来     为什么？ 因为没有新娘会很尴尬18. 此刻我很挂念你，请为我小心照顾自己19. 这里哪都好就是没有你20. 你心不心疼我啊？心在你那里，疼不疼你说了算21. 我不能给你全世界，我的全世界可以给你。 22. 我昨天很爱你今天不想爱了，但我知道明天醒过来 最爱的人还是你23. 我有女朋友了.那她一定长得很漂亮吧.你怎么那么自恋24. 我要偷你的体温   说人话   ……要抱抱25. 快说你喜欢我，然后我拒绝你   我喜欢你      那我们就在一起吧!”26. 你想养狗吗?    什么狗?   单身的那种27. 想把整个夏天的阳光在冬天时寄给你28. 我正在努力变优秀你先不要喜欢别的小朋友29. 你有女朋友吗?没有的话想不想有一个，有的话要不要换一个，不换的话介意不介意多一个。30. 别人爱你只是想和你上床，我不一样，沙发，厨房，都可以31. 我想和你一房二人三餐四季32. 你怕不怕麻烦？不怕的话的话那就麻烦你跟我在一起吧33. 连了我家wifi，你就是我家的人了34.真希望我的孩子笑起来有你的模样35 遇见你，花了我半生的运气，因为还有半生，我要用来和你共度余生36. 要脸干什么 要脸可以追到你嘛？37. 对你何止喜欢啊 简直就是想cao（开了一下小车，应该没人看见）38. 我不想听你说晚安 我想和你一起睡39. 你是我的平方，除了你还是你40 我喜欢你”这句话有点重，先撂这儿了你帮我拿一下41. 想和你喝酒是假，想醉你怀里是真42. 我和我的猫都很想你，可是我没有猫，也没有你43 小哥哥，帮个忙，我爸妈想要个女婿44 不是除了你，我就没人要了   只是除了你，我谁都不想要45. 我只是喜欢你，没有恶意46 你在我左胸第五根肋骨一寸往里的地方。听他们说那里是心脏47 你有地图吗？我在你的眼睛里迷路了48. 你忙归忙，但是你看什么时候有空就娶我49. 论美女的等级：小家碧玉，出水芙蓉，窈窕淑女，倾国倾城，你50. 你还想要一个妈妈嘛，我把我的妈妈分给你51. 你说你怎么这么会长，刚好是我喜欢的模样52 我没什么出息，想只想花你的钱，住你的房，睡你的床，做你的人53. 我有一个超能力 嗯，超喜欢你54 你长得特别像我一个亲戚        啊？  我妈的女婿……55. 你上辈子一定是碳酸饮料吧，要不然为什么我看见你就开心的冒泡56 如果套路到你了，对不起，我是故意的57. 无事献殷勤，非。。。非常喜欢你58. 你可以帮我洗一个东西吗？洗什么，喜欢我59. 我想把草莓种在37.2度的土壤里60 你妈妈没教你礼尚往来吗？我喜欢你，你就只能喜欢我61. 别生气了，你生气不高兴了还不是得我哄你62. 你看我手有什么特别嘛？唉，其实没有，毕竟没被你牵过（我用这个去套路过小哥哥，我问他有没有什么特别，他说，特别丑……？？？what？想挨打直说啊）63. 我……觉得你长得好像我下一个男朋友啊64. 知道你为什么这么冷吗？因为你没有像我这么暖的对象在身边啊65.我喜欢你，像你妈打你，不讲道理66. 我说不清我为什么爱你，我只知道，只要有你，我就不可能爱上别人。67.以前我觉得一辈子只跟一个女人在一起，太恐怖了，但如果那个女人是你，我只恨一辈子太短68. 一想到昨天的我也喜欢你 今天的我就吃醋了69.   你毕业之后想做什么？emmm，我想做你媳妇70.  最近总有谣言说我喜欢你，我澄清一下，那不是谣言72.  你有打火机嘛？没有 那你是如何点燃我的心的73  你可以笑一下嘛？为什么  因为我刚刚喝水忘记放糖了72.  你在哪里啊？我在xxx，不，你在我心里73.  外面风大 跟我回家74.  我没说过永远 只希望每个明天你都在75.  南风过境十里春风不如你76.  为什么喜欢你啊，可能时间刚好 你眼角带笑77.  在吗？嗯  你知道中国人和外国人的区别是什么嘛？不知道  外国人说喜欢你是I love you  中国人说喜欢你是问你在吗78.  我觉得我好花心，你每天的样子我都好喜欢79.  你不喜欢我?告诉你，过了这个村，我在下个村等你！80.  我真的很好亲近的，不信～你亲一下81  最近我很想你，最远～也是`;

 const s2 = `
82.  “如果你是方便面你觉得你是什么味的？” “红烧牛肉？” “那我可以泡你吗?” 83.  我十拿九稳 就只差你一吻了 84.  “我想在你那买一块地”“什么地?” “你对我的死心塌地。 85.  遇见你才觉得人生苦短，甜长。 86.   “这是我的手背，这是我的脚背，你是我的宝贝。” 87.  可爱不是长久之计，可爱我是。 88.  “我一点也不想你，一点半再想” 89.  “你猜我现在是想你还是想睡觉?""想我？”“不是，是想和你睡觉” 90.  想给你备注为一行，因为干一行，爱一行。 91.  小猪佩奇你配我 92.“你知道我有什么缺点吗?”“缺点你” 93.今天不是你死就是我死，你可爱死了，我爱死你了！ 94.你是什么血型?  xx血型，不，你是我的的理想型 95.“土豆会变成土豆泥，猜猜我会变成什么呢?”“不知道”“我爱泥” 96. 你知道我喜欢喝什么吗?     呵护你  97.  你今天好奇怪，怪可爱的。 98.  我觉得你接近我就是在害我，害得我好喜欢你99.   跟我走吧 忐忑给你 情书给你 不眠的夜给你 四月的清晨给你 雪糕的第一口给你 海底捞最后一颗鱼丸给你 手给你 怀抱给你 车票给你 跋涉给你 等待给你 钥匙给你 家给你 一腔孤勇和余生六十年 全都给你100.  在所有人事已非的景色里，我最喜欢你101.  诸神降临 不及你一弯眉眼里的星辰大海102. 这世间青山灼灼 星光杳杳 秋雨淅淅 晚风慢慢 也抵不过公子眉目间的星辰103. 世间万般都是苦的 只有你是草莓味的104. 明人不说暗话，我……喜欢你～105. 小女子不才，掐指一算，公子今生缺我`;
 const s3 = `106.  子曰：三思而后行，1 2 3～嗯～我喜欢你107.  未经允许，擅自特别喜欢你，不好意思108.  风吹幡动，你说是风动了还是幡动？     嘿嘿嘿 是心动109. 人间太吵了，你来我心里吧110.诶，你脸上有点东西啊    啊？有什么？有点漂亮111.我真的很甜，不信你尝尝(⁄ ⁄•⁄ω⁄•⁄ ⁄)
`;
 const s4 = `1.咱们应当在一起，否则就太伤天害理啦。2.不管我本人多么平庸，我总觉得对你的爱很美。3.你真好，我真爱你。可惜我不是诗人，说不出更动听的话了！4. 当我跨过沉沦的一切，向着永恒开战的时候，你是我的军旗。5.你做梦也想不到，我把信写到五线谱上吧？五线谱是偶然来的，你也是偶然来的。不过我给你的信值得写在五线谱里呢。但愿我和你，是一只唱不完的歌。6.你好哇！李银河～我会不爱你吗？不会。爱你就像爱生命。7.我把我整个灵魂都给你，连同它的怪癖，耍小脾气，忽明忽暗，一千八百种坏毛病。它真讨厌，只有一点好，爱你。8.我很讨厌我自己不温不凉的思虑过度，也许我是个坏人，不过我只要你吻我一下就会变好呢。9.告诉你，一想到你，我这张丑脸上就泛起微笑。10.你要是愿意，我就永远爱你。你要是不愿意，我就永远相思。11.我是个俗气至顶的人，见山是山，见海是海，见花便是花。唯独见了你，云海开始翻涌，江潮开始澎湃，昆虫的小触须挠着全世界的痒。你无需开口，我和天地万物便通通奔向你。12.生为冰山，就该淡淡地爱海流、爱风，并且在偶然接触时，全心全意地爱另一块冰山。13.你好哇，李银河。14.祝你今天愉快。你明天的愉快留着我明天再祝。15.有时候你难过了，这时候我更爱你。只要你不拒绝我就拥抱你，我会告诉你这是因为什么。就是我不知道为了什么。16.因为什么都不是爱的对手，除了爱。17.静下来想你，觉得一切都美好的不可思议。18.你的名字美极了。真的，单单你的名字就够我爱一世的了。19.你让我想起光辉、希望、醉人的美好。20.我只求你告诉我，我到底能不能得到你。我还不算太笨，还能干好多事情。21.我的勇气和你的勇气加起来，对付这个世界总够了吧。22.我对好多人都怀有最深的感情，尤其是对你。23.自从我认识了你，所有的人都黯然失色。24.什么排山倒海的力量也止不住两个相爱过的人的互助。我觉得我爱了你了，从此以后，不管什么时候我都不能对你无动于衷。25.习惯多么可怕，就像人习惯空气，鱼习惯水，而我习惯爱你。26.我和你分别以后才明白，原来我对你爱恋的过程全是在分别中完成的。就是说，每一次见面之后，你给我的印象都使我在余下的日子里用我这愚笨的头脑里可能想到的一切称呼来呼唤你。比方说，这一次我就老想到：爱，爱呵。你不要见怪：爱，就是你啊。27.你是非常可爱的人，真应该遇到最好的人，我也真希望我就是。`;
 const s5 = `你知道我最喜欢什么神吗？你的眼神33.33.

 你有没有闻到什么烧焦的味道？

 那是我的心在燃烧。33.33.

 你有没有闻到什么味道？

 没有啊。

 怎么一遇见你空气都变得甜甜的了。33.33.

 猜猜我的心在哪边?

 左边。

 错了啦，在你那边。33.33.

 你能不能别说话了。

 我没有啊。

 那为什么我满脑子都是你的声音?33.33.

 我对你的爱，就像拖拉机上山，轰轰烈烈。33.33.

 游乐园有个有音乐的、可以骑在上面的那个叫旋转什么来着？

 木马

 mua～33.33.

 既然你已经把我的心弄乱了，那你打算什么时候来弄乱我的床?33.33.

 三十晚上的鞭炮再响，都没有我想你那么想。33.33.

 别让我再见到你了，不然我见你一次，喜欢一次！33.33.

 我去取一下东西。

 好的。

 你好，我过来娶你了。33.33.

 你知道墙、眼睛、膝盖的英文怎么说么？

 wall、eye、knee

 我也爱你。33.33.

 我觉得你好像一款游戏啊。

 什么游戏?

 我的世界。33.33.

 你知道菜什么时候吃最好吃么？

 趁热吃?

 你喂我吃。33.33.

 想在你身上钻木取火，点燃此生。33.33.

 你知道我最爱的是什么吗？

 是什么？

 上一句话的第一个字。33.33.

 如果你会游泳的话，那就可以在我的爱河里畅游了。33.33.

 装戒指的盒子叫戒指盒，你知道装我和你的盒子叫什么盒么?

 什么盒?

 天作之合。33.33.

 你会弹钢琴么?

 不会。

 那你怎么撩动了我的心弦?33.33.

 人生不如意事十有八九，而你是一二。33.33.

 我不但可爱，我还可爱你了呢。33.33.

 我不想和你作对，我只想和你做一对。33.33.

 这么困你昨晚是去做贼了吗？

 对啊，去偷你的心了。33.33.

 你给我想清楚再说话。

 我没有想清楚，我在想你。33.33.

 你生是我的猪，死是我的五花肉。33.33.

 奶奶妈妈和老婆哪个和你没有血缘关系？

 老婆

 诶～33.33.

 我最近一直在找一家店

 什么店

 你的来电。33.33.

 跟你捉迷藏的话我肯定输。

 为什么？

 因为爱你的心怎么也藏不住。33.33.

 我那天看了个电影竟然和我喜欢的人名字一样。

 什么电影?

 你的名字。33.33.

 你可以笑一下吗?我的咖啡没加糖。`;

 const s6 = `“如果你是方便面你觉得你是什么味的？” “红烧牛肉？” “那我可以泡你吗?”33.33.我十拿九稳 就只差你一吻了。33.33.如果有人追你 我就绊倒她/他。33.33.“我想在你那买一块地”

 “什么地?” “你对我的死心塌地。33.33.遇见你才觉得人生苦短，甜长。33.33.“这是我的手背，这是我的脚背，你是我的宝贝。”33.33.可爱不是长久之计，可爱我是。33.33.“我一点也不想你，一点半再想”33.33.“你猜我现在是想你还是想睡觉?"

 "想我？”

 “不是，是想和你睡觉”33.33.想给你备注为一行，因为干一行，爱一行。33.33.小猪佩奇你配我33.33.“你知道我有什么缺点吗?”

 “缺点你”33.33.今天不是你死就是我死，你可爱死了，我爱死你了！33.33.

 “你是什么血型?”

 “你的理想型。”33.33.你不喜欢我?

 告诉你，过了这个村，我在下个村等你！33.33.“土豆会变成土豆泥，猜猜我会变成什么呢?”

 “不知道”

 “我爱泥”33.33.你知道我喜欢喝什么吗?

 呵护你 。33.33.有谣言说我喜欢你，我澄清一下，那不是谣言。33.33.只许州官放火 不许……你离开我。33.33.见到你之后我就开始吃素。

 为什么？

 因为你是我的菜。33.33.“你今天好奇怪，怪可爱的。”33.33.你昨天晚上应该很累吧，因为你在我梦里一直跑个不停。33.33.“我觉得你接近我就是在害我，害得我好喜欢你呀”`;
 export let text = (s + s2 + s3 + s4 + s5 + s6 ).replace(/[0-9]+(、|.|\n)/g, '$$$').split('$$').filter((e) => {
  return e.length > 5;
});
